tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
cask "java" unless system "/usr/libexec/java_home --failfast"
brew "coursier/formulas/coursier"
brew "olafurpg/scalafmt/scalafmt", args: ["HEAD"]
brew "haskell-stack"
brew "libyaml"
brew "cmake"
brew "emacs", args: ["--with-cocoa"]
brew "elm"
brew "fzf"
brew "python"
brew "ansible"
brew "git"
brew "go"
brew "mas"
brew "maven"
brew "neovim"
brew "netperf"
brew "sbt"
brew "the_silver_searcher"
brew "vim"
brew "node"
brew "yarn"
brew "youtube-dl"
cask "1password"
cask "adobe-creative-cloud"
cask "atom"
cask "backblaze"
cask "carbon-copy-cloner"
cask "dropbox"
cask "firefox"
cask "flux"
cask "gpgtools"
cask "hazel"
cask "intellij-idea-next-ce-eap"
cask "iterm2"
cask "resilio-sync"
cask "silverlight"
cask "spectacle"
cask "spotify"
cask "vlc"
cask "visual-studio-code"
cask "xquartz"
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Reeder", id: 880001334
mas "Soulver", id: 413965349
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
cask "font-meslo-for-powerline"
