tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap 'paulp/extras'

brew "haskell-stack"
brew "go"
brew "sbt"

brew "fzf"
brew "jq"
brew "gource"
brew "ffmpeg"
brew "gperftools"
brew "kubectx"

brew "python"
brew "python2"
brew "pipenv"

brew "curl"
brew "coreutils"
brew "tree"
brew "vim"

brew "git"
brew "subversion"

brew "maven"
brew "maven@3.2"

brew "node"
brew "yarn"

brew "gnupg"
cask "keybase"
brew "pinentry-mac"

brew "mas"
brew "the_silver_searcher"
brew "youtube-dl"
brew "awscli"
cask "alfred"
cask "google-cloud-sdk"
cask "docker"
cask "iterm2"
cask "spectacle"
cask "vlc"
cask "visual-studio-code"
cask "font-meslo-for-powerline"
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Reeder", id: 880001334
mas "Soulver", id: 413965349
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
