tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/core"

tap "cloudflare/cloudflare"
brew "cloudflare/cloudflare/cloudflared"

tap "paulp/extras"
brew "paulp/extras/sbtx", args: ["HEAD"]

brew "haskell-stack"
brew "go"
cask "java8"

brew "fzf"
brew "jq"
brew "gource"
brew "gperftools"

brew "kubectx"

brew "python"
brew "python@2"
brew "pipenv"

brew "curl"
brew "coreutils"
brew "tree"
brew "vim"

brew "git"
brew "subversion"
brew "hub"

brew "maven"
brew "maven@3.2"

brew "node"
brew "yarn"

brew "gnupg"
cask "keybase"
brew "pinentry-mac"
cask "keepassxc"

brew "awscli"
cask "google-cloud-sdk"
brew "terraform"
brew "vault"
brew "terragrunt"
brew "kubernetes-helm"

brew "graphviz"
brew "ffmpeg"
brew "mas"
brew "the_silver_searcher"
brew "youtube-dl"
brew "watch"

cask "alfred"
cask "docker"
cask "iterm2"
cask "nvalt"
cask "spectacle"
cask "vlc"
cask "visual-studio-code"
cask "font-meslo-for-powerline"
cask "dropbox"
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "iMovie", id: 408981434
mas "GarageBand", id: 682658836
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Reeder", id: 880001334
mas "Soulver", id: 413965349
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
mas "Agenda", id: 1287445660
